#ifndef  _ITEM_DATA_H_
#define  _ITEM_DATA_H_

#define MAX_NUM_ITEM 32

char* itemName[MAX_NUM_ITEM]={"头像1","头像2","头像3","头像4","头像5","头像6","头像7","头像8","头像9","头像10","头像11","头像12",
		"头像13","头像14","头像15","头像16","头像17","头像18","头像19","头像20","头像21","头像22","头像23","头像24","头像25","头像26","头像27",
		"头像28","头像29","头像30","头像31","头像32",};  //存储商品名称
//char *itemValue[MAX_NUM_ITEM]={"￥ 5", "￥ 8","￥ 15","￥ 10","￥ 10","￥ 10","￥ 10","￥ 10","￥ 10","￥ 10"};
int value[MAX_NUM_ITEM]={10,10,10,10,10,10,10,10,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,20,}; //商品价格

#endif

